In [1]:
import sqlite3
from sqlite3 import Error

 
def create_connection(db_file):
    """ create a database connection to the SQLite database
        specified by the db_file
    :param db_file: database file
    :return: Connection object or None
    """
    conn = None
    try:
        conn = sqlite3.connect(db_file)
        print(sqlite3.version)
    except Error as e:
        print(e)
 
    return conn

 
def select_all_tasks(conn):
    """
    Query all rows in the tasks table
    :param conn: the Connection object
    :return:
    """
    cur = conn.cursor()
    
    query1 = """
        SELECT *
        FROM FACILITIES
        """
    cur.execute(query1)
 
    rows = cur.fetchall()
 
    for row in rows:
        print(row)


def main():
    database = "sqlite_db_pythonsqlite.db"
 
    # create a database connection
    conn = create_connection(database)
    with conn: 
        print("2. Query all tasks")
        select_all_tasks(conn)
 
 
if __name__ == '__main__':
    main()

2.6.0
2. Query all tasks
(0, 'Tennis Court 1', 5, 25, 10000, 200)
(1, 'Tennis Court 2', 5, 25, 8000, 200)
(2, 'Badminton Court', 0, 15.5, 4000, 50)
(3, 'Table Tennis', 0, 5, 320, 10)
(4, 'Massage Room 1', 9.9, 80, 4000, 3000)
(5, 'Massage Room 2', 9.9, 80, 4000, 3000)
(6, 'Squash Court', 3.5, 17.5, 5000, 80)
(7, 'Snooker Table', 0, 5, 450, 15)
(8, 'Pool Table', 0, 5, 400, 15)

In [2]:
def run_query(query):
    conn = sqlite3.connect("sqlite_db_pythonsqlite.db")
    cur = conn.cursor()
    cur.execute(query)
    rows = cur.fetchall()
    for row in rows:
        print(row)

query = """
        SELECT *
        FROM FACILITIES
        """
run_query(query)

(0, 'Tennis Court 1', 5, 25, 10000, 200)
(1, 'Tennis Court 2', 5, 25, 8000, 200)
(2, 'Badminton Court', 0, 15.5, 4000, 50)
(3, 'Table Tennis', 0, 5, 320, 10)
(4, 'Massage Room 1', 9.9, 80, 4000, 3000)
(5, 'Massage Room 2', 9.9, 80, 4000, 3000)
(6, 'Squash Court', 3.5, 17.5, 5000, 80)
(7, 'Snooker Table', 0, 5, 450, 15)
(8, 'Pool Table', 0, 5, 400, 15)

In [3]:
query = """
        SELECT name 
        FROM Facilities
        WHERE membercost > 0;
        """
run_query(query)

('Tennis Court 1',)
('Tennis Court 2',)
('Massage Room 1',)
('Massage Room 2',)
('Squash Court',)

In [4]:
query = """
        SELECT COUNT(*)
        FROM Facilities
        WHERE membercost = 0;
        """

run_query(query)

(4,)

In [5]:
query = """
        SELECT facid, name, membercost, monthlymaintenance
    FROM Facilities
    WHERE membercost < (monthlymaintenance * 0.20) AND membercost > 0;
        """

run_query(query)

(0, 'Tennis Court 1', 5, 200)
(1, 'Tennis Court 2', 5, 200)
(4, 'Massage Room 1', 9.9, 3000)
(5, 'Massage Room 2', 9.9, 3000)
(6, 'Squash Court', 3.5, 80)

In [6]:
query = """
        SELECT *
        FROM Facilities
        WHERE facid IN (1,5);
        """

run_query(query)

(1, 'Tennis Court 2', 5, 25, 8000, 200)
(5, 'Massage Room 2', 9.9, 80, 4000, 3000)

In [7]:
query = """
        SELECT name, monthlymaintenance,
    CASE
        WHEN monthlymaintenance > 100 THEN 'Expensive'
        WHEN monthlymaintenance <= 100 THEN 'Cheap'
    END AS tier
    FROM Facilities;
        """

run_query(query)

('Tennis Court 1', 200, 'Expensive')
('Tennis Court 2', 200, 'Expensive')
('Badminton Court', 50, 'Cheap')
('Table Tennis', 10, 'Cheap')
('Massage Room 1', 3000, 'Expensive')
('Massage Room 2', 3000, 'Expensive')
('Squash Court', 80, 'Cheap')
('Snooker Table', 15, 'Cheap')
('Pool Table', 15, 'Cheap')

In [8]:
query = """
       SELECT firstname, surname
    FROM Members,
        (SELECT MAX(joindate) AS maxdate
        FROM Members) as sub
    WHERE joindate = sub.maxdate;
        """

run_query(query)

('Darren', 'Smith')

In [11]:
query = """
    SELECT DISTINCT(memid), name, (firstname || ' ' || surname) AS member
        FROM Bookings
        LEFT JOIN Facilities
        USING (facid)
        LEFT JOIN Members
        USING (memid)
        WHERE facid IN (0,1)
            AND surname <> "GUEST"
        ORDER BY member;
        """

run_query(query)

(12, 'Tennis Court 1', 'Anne Baker')
(12, 'Tennis Court 2', 'Anne Baker')
(6, 'Tennis Court 2', 'Burton Tracy')
(6, 'Tennis Court 1', 'Burton Tracy')
(10, 'Tennis Court 1', 'Charles Owen')
(10, 'Tennis Court 2', 'Charles Owen')
(1, 'Tennis Court 2', 'Darren Smith')
(28, 'Tennis Court 1', 'David Farrell')
(28, 'Tennis Court 2', 'David Farrell')
(11, 'Tennis Court 2', 'David Jones')
(11, 'Tennis Court 1', 'David Jones')
(17, 'Tennis Court 1', 'David Pinker')
(26, 'Tennis Court 1', 'Douglas Jones')
(36, 'Tennis Court 1', 'Erica Crumpet')
(15, 'Tennis Court 2', 'Florence Bader')
(15, 'Tennis Court 1', 'Florence Bader')
(5, 'Tennis Court 1', 'Gerald Butters')
(5, 'Tennis Court 2', 'Gerald Butters')
(27, 'Tennis Court 2', 'Henrietta Rumney')
(14, 'Tennis Court 1', 'Jack Smith')
(14, 'Tennis Court 2', 'Jack Smith')
(4, 'Tennis Court 1', 'Janice Joplette')
(4, 'Tennis Court 2', 'Janice Joplette')
(13, 'Tennis Court 2', 'Jemima Farrell')
(13, 'Tennis Court 1', 'Jemima Farrell')
(22, 'Tennis Court 1', 'Joan Coplin')
(35, 'Tennis Court 1', 'John Hunt')
(35, 'Tennis Court 2', 'John Hunt')
(20, 'Tennis Court 1', 'Matthew Genting')
(30, 'Tennis Court 2', 'Millicent Purview')
(7, 'Tennis Court 2', 'Nancy Dare')
(7, 'Tennis Court 1', 'Nancy Dare')
(9, 'Tennis Court 2', 'Ponder Stibbons')
(9, 'Tennis Court 1', 'Ponder Stibbons')
(24, 'Tennis Court 2', 'Ramnaresh Sarwin')
(24, 'Tennis Court 1', 'Ramnaresh Sarwin')
(8, 'Tennis Court 2', 'Tim Boothe')
(8, 'Tennis Court 1', 'Tim Boothe')
(3, 'Tennis Court 2', 'Tim Rownam')
(3, 'Tennis Court 1', 'Tim Rownam')
(16, 'Tennis Court 2', 'Timothy Baker')
(16, 'Tennis Court 1', 'Timothy Baker')
(2, 'Tennis Court 1', 'Tracy Smith')
(2, 'Tennis Court 2', 'Tracy Smith')

In [13]:
query = """
        SELECT  name, 
                (firstname || ' ' || surname) AS member,
                (CASE WHEN memid = 0 THEN (slots * guestcost)
                    ELSE (slots * membercost) END) AS cost
        FROM Bookings
        LEFT JOIN Facilities
        USING(facid)
        LEFT JOIN Members
        USING(memid)
        WHERE starttime LIKE '2012-09-14%'
            AND (CASE WHEN memid = 0 THEN guestcost
                    ELSE membercost END) > 30
        ORDER BY cost DESC;
        """

run_query(query)

('Massage Room 2', 'GUEST GUEST', 320)
('Massage Room 1', 'GUEST GUEST', 160)
('Massage Room 1', 'GUEST GUEST', 160)
('Massage Room 1', 'GUEST GUEST', 160)

In [14]:
query = """
        SELECT name, member, cost
        FROM (SELECT name,
                     (firstname || ' ' || surname) AS member,
                     (CASE WHEN memid = 0 THEN guestcost
                        ELSE membercost END) AS cost
                FROM Bookings
                LEFT JOIN Facilities
                USING (facid)
                LEFT JOIN Members
                USING (memid)
                WHERE starttime LIKE '2012-09-14%') AS sub
        WHERE cost > 30 
        ORDER BY cost DESC;
        """

run_query(query)

('Massage Room 1', 'GUEST GUEST', 80)
('Massage Room 1', 'GUEST GUEST', 80)
('Massage Room 1', 'GUEST GUEST', 80)
('Massage Room 2', 'GUEST GUEST', 80)

In [15]:
query = """
    SELECT sub.facility_name, sub.revenue
    FROM
    (SELECT f.name AS facility_name, 
            SUM(CASE 
                WHEN b.memid <> 0 THEN (f.membercost * b.slots)
                WHEN b.memid = 0 THEN (f.guestcost * b.slots)
                END) AS revenue

        FROM Bookings AS b
        LEFT JOIN Facilities AS f
        ON b.facid = f.facid
        GROUP BY f.name) AS sub
    WHERE sub.revenue < 1000
    ORDER BY sub.revenue
        """

run_query(query)

('Table Tennis', 180)
('Snooker Table', 240)
('Pool Table', 270)

In [16]:
query = """
    SELECT m2.surname AS mem_last_name, m2.firstname AS mem_first_name, 
        m1.surname AS rec_by_last_name, m1.firstname AS rec_by_first_name
    FROM Members AS m1
    INNER JOIN Members as m2
    WHERE m2.recommendedby = m1.memid AND
    m1.surname <> 'GUEST'
    ORDER BY m2.surname, m2.firstname
        """

run_query(query)

('Bader', 'Florence', 'Stibbons', 'Ponder')
('Baker', 'Anne', 'Stibbons', 'Ponder')
('Baker', 'Timothy', 'Farrell', 'Jemima')
('Boothe', 'Tim', 'Rownam', 'Tim')
('Butters', 'Gerald', 'Smith', 'Darren')
('Coplin', 'Joan', 'Baker', 'Timothy')
('Crumpet', 'Erica', 'Smith', 'Tracy')
('Dare', 'Nancy', 'Joplette', 'Janice')
('Genting', 'Matthew', 'Butters', 'Gerald')
('Hunt', 'John', 'Purview', 'Millicent')
('Jones', 'David', 'Joplette', 'Janice')
('Jones', 'Douglas', 'Jones', 'David')
('Joplette', 'Janice', 'Smith', 'Darren')
('Mackenzie', 'Anna', 'Smith', 'Darren')
('Owen', 'Charles', 'Smith', 'Darren')
('Pinker', 'David', 'Farrell', 'Jemima')
('Purview', 'Millicent', 'Smith', 'Tracy')
('Rumney', 'Henrietta', 'Genting', 'Matthew')
('Sarwin', 'Ramnaresh', 'Bader', 'Florence')
('Smith', 'Jack', 'Smith', 'Darren')
('Stibbons', 'Ponder', 'Tracy', 'Burton')
('Worthington-Smyth', 'Henry', 'Smith', 'Tracy')

In [17]:
query = """
        SELECT name, SUM(slots)
        FROM Bookings
        LEFT JOIN Facilities
        USING (facid)
        WHERE memid > 0
        GROUP BY facid
        """

run_query(query)

('Tennis Court 1', 957)
('Tennis Court 2', 882)
('Badminton Court', 1086)
('Table Tennis', 794)
('Massage Room 1', 884)
('Massage Room 2', 54)
('Squash Court', 418)
('Snooker Table', 860)
('Pool Table', 856)

In [18]:
query = """
        SELECT name, SUM(slots) AS uses, strftime('%m', starttime) AS month
        FROM Bookings
        LEFT JOIN Facilities
        USING (facid)
        WHERE memid > 0
        GROUP BY month, facid
        ORDER BY month, name
        """

run_query(query)

('Badminton Court', 165, '07')
('Massage Room 1', 166, '07')
('Massage Room 2', 8, '07')
('Pool Table', 110, '07')
('Snooker Table', 140, '07')
('Squash Court', 50, '07')
('Table Tennis', 98, '07')
('Tennis Court 1', 201, '07')
('Tennis Court 2', 123, '07')
('Badminton Court', 414, '08')
('Massage Room 1', 316, '08')
('Massage Room 2', 18, '08')
('Pool Table', 303, '08')
('Snooker Table', 316, '08')
('Squash Court', 184, '08')
('Table Tennis', 296, '08')
('Tennis Court 1', 339, '08')
('Tennis Court 2', 345, '08')
('Badminton Court', 507, '09')
('Massage Room 1', 402, '09')
('Massage Room 2', 28, '09')
('Pool Table', 443, '09')
('Snooker Table', 404, '09')
('Squash Court', 184, '09')
('Table Tennis', 400, '09')
('Tennis Court 1', 417, '09')
('Tennis Court 2', 414, '09')